{
    "name": "Makroekonomi",
    "description": "Makroekonomi, bir ekonominin genel yapısını, toplam ekonomik faaliyetlerini ve geniş ölçekteki ekonomik göstergeleri inceleyen iktisat dalıdır. Bireylerin, firmaların ve hükümetin toplam ekonomik davranışlarını analiz eder. Makroekonomi, ekonomik büyüme, işsizlik, enflasyon, para ve maliye politikaları gibi konulara odaklanır.",
    "children": [
        {
            "name": "Temel Göstergeler",
            "description": "Ekonominin sağlığını ve performansını ölçmek için kullanılan ana göstergelerdir. Bu göstergeler, ekonomik analiz ve politika oluşturma süreçlerinde kritik rol oynar.",
            "children": [
                {
                    "name": "GSYH (Gayri Safi Yurtiçi Hasıla)",
                    "description": "Bir ülkenin belli bir dönemde ürettiği nihai mal ve hizmetlerin toplam değeridir. Ekonomik büyümenin temel göstergesidir.",
                    "children": [
                        {
                            "name": "Nominal GSYH",
                            "description": "Mevcut piyasa fiyatları üzerinden hesaplanan GSYH'dir. Enflasyon etkisini içerir.",
                            "children": [
                                {
                                    "name": "Fiyat Düzeltmesi",
                                    "description": "Nominal GSYH'nin enflasyon etkisini çıkararak reel GSYH'ye dönüştürülmesi süreci."
                                },
                                {
                                    "name": "Bileşen Analizi",
                                    "description": "Nominal GSYH'nin tüketim, yatırım, kamu harcamaları ve net ihracat gibi bileşenlere ayrılması."
                                }
                            ]
                        },
                        {
                            "name": "Reel GSYH",
                            "description": "Fiyat değişikliklerini hesaba katarak, sabit fiyatlarla hesaplanan GSYH'dir. Ekonomik büyümeyi daha doğru yansıtır.",
                            "children": [
                                {
                                    "name": "Temel Yılı Seçimi",
                                    "description": "Reel GSYH hesaplamasında kullanılan baz yılın belirlenmesi."
                                },
                                {
                                    "name": "Büyüme Oranları",
                                    "description": "Reel GSYH'deki yıllık büyüme oranlarının analiz edilmesi."
                                }
                            ]
                        },
                        {
                            "name": "GSYH'nin Sektörel Dağılımı",
                            "description": "GSYH'nın tarım, sanayi ve hizmetler gibi farklı sektörlerde nasıl dağıldığını gösterir.",
                            "children": [
                                {
                                    "name": "Tarım Sektörü",
                                    "description": "Tarım faaliyetlerinin GSYH içindeki payı ve dinamikleri."
                                },
                                {
                                    "name": "Sanayi Sektörü",
                                    "description": "Üretim, imalat ve inşaat gibi sanayi faaliyetlerinin GSYH'ye katkısı."
                                },
                                {
                                    "name": "Hizmetler Sektörü",
                                    "description": "Finans, sağlık, eğitim ve turizm gibi hizmet sektörlerinin GSYH'ye etkisi."
                                }
                            ]
                        },
                        {
                            "name": "GSYH Deflatörü",
                            "description": "Nominal GSYH ile reel GSYH arasındaki fiyat seviyesindeki değişimi ölçen bir endekstir.",
                            "children": [
                                {
                                    "name": "Hazine Deflatörü",
                                    "description": "Hazine tarafından hesaplanan GSYH deflatörü."
                                },
                                {
                                    "name": "Tüketici Fiyat Endeksi (TÜFE) Bazlı Deflatör",
                                    "description": "TÜFE verilerine dayalı olarak hesaplanan GSYH deflatörü."
                                },
                                {
                                    "name": "Üretici Fiyat Endeksi (ÜFE) Bazlı Deflatör",
                                    "description": "ÜFE verilerine dayalı olarak hesaplanan GSYH deflatörü."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Enflasyon",
                    "description": "Fiyat genel düzeyindeki sürekli artışı ifade eder. Ekonomide paranın satın alma gücünün azalmasına yol açar.",
                    "children": [
                        {
                            "name": "Talep Enflasyonu",
                            "description": "Toplam talebin toplam arzı aştığı durumlarda ortaya çıkar. Tüketim, yatırım gibi harcamaların artması sonucu fiyatlar yükselir.",
                            "children": [
                                {
                                    "name": "Tüketici Talebi",
                                    "description": "Hanehalklarının mal ve hizmetlere yönelik artan talebi."
                                },
                                {
                                    "name": "Yatırım Talebi",
                                    "description": "Firmaların üretim kapasitesini artırmak için yaptığı yatırımların talebi artırması."
                                }
                            ]
                        },
                        {
                            "name": "Maliyet Enflasyonu",
                            "description": "Üretim maliyetlerindeki artışın (işçilik, hammadde) fiyatlara yansıması sonucu oluşur.",
                            "children": [
                                {
                                    "name": "İşçilik Maliyetleri",
                                    "description": "Ücret artışlarının üretim maliyetlerine etkisi."
                                },
                                {
                                    "name": "Hammadde Fiyatları",
                                    "description": "Hammadde fiyatlarındaki dalgalanmaların maliyet enflasyonuna etkisi."
                                }
                            ]
                        },
                        {
                            "name": "Yapısal Enflasyon",
                            "description": "Ekonominin yapısal değişikliklerinden kaynaklanan fiyat artışlarıdır. Sektörler arası dengesizlikler buna örnektir.",
                            "children": [
                                {
                                    "name": "Sektörel Dengesizlikler",
                                    "description": "Belirli sektörlerdeki arz ve talep dengesizliklerinin enflasyona etkisi."
                                },
                                {
                                    "name": "Piyasa Yapısı Değişiklikleri",
                                    "description": "Monopolistik veya oligopolistik piyasa yapılarının fiyatlandırma gücüne etkisi."
                                }
                            ]
                        },
                        {
                            "name": "Beklenen Enflasyon",
                            "description": "Gelecekteki enflasyon oranlarının ekonomik aktörler tarafından öngörülmesi ve buna göre davranılması.",
                            "children": [
                                {
                                    "name": "Enflasyon Beklentileri",
                                    "description": "Hanehalkları ve firmaların gelecekteki fiyat artışlarına dair beklentileri."
                                },
                                {
                                    "name": "Adaptif Beklentiler",
                                    "description": "Geçmiş enflasyon oranlarına dayanarak gelecekteki enflasyonu tahmin etme yöntemi."
                                },
                                {
                                    "name": "Rasyonel Beklentiler",
                                    "description": "Ekonomik aktörlerin tüm mevcut bilgileri kullanarak gelecekteki enflasyonu doğru tahmin etmeye çalışmaları."
                                }
                            ]
                        },
                        {
                            "name": "Çekirdek Enflasyon",
                            "description": "Gıda ve enerji gibi volatil kalemler hariç tutulduğunda kalan enflasyon oranıdır.",
                            "children": [
                                {
                                    "name": "Gıda Fiyatları",
                                    "description": "Gıda sektöründeki fiyat dalgalanmalarının çekirdek enflasyon üzerindeki etkisi."
                                },
                                {
                                    "name": "Enerji Fiyatları",
                                    "description": "Enerji sektöründeki fiyat değişikliklerinin çekirdek enflasyondan ayrı tutulması."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "İşsizlik",
                    "description": "Ekonomide iş arayan ancak iş bulamayan bireylerin oranıdır. İşsizlik oranı, ekonomik sağlık ve iş piyasası dinamiklerini yansıtır.",
                    "children": [
                        {
                            "name": "Yapısal İşsizlik",
                            "description": "Ekonominin yapısal değişiklikleri sonucu ortaya çıkan işsizliktir. Beceriler ile iş piyasası ihtiyaçları arasındaki uyumsuzluktan kaynaklanır.",
                            "children": [
                                {
                                    "name": "Becerilerin Eşleşmemesi",
                                    "description": "İş arayanların sahip olduğu beceriler ile işverenlerin aradığı beceriler arasındaki uyumsuzluk."
                                },
                                {
                                    "name": "Teknolojik Değişim",
                                    "description": "Yeni teknolojilerin işgücü talebini değiştirmesi sonucu bazı işlerin azalması."
                                }
                            ]
                        },
                        {
                            "name": "Döngüsel İşsizlik",
                            "description": "Ekonomik dalgalanmalar (resesyon) sırasında iş gücünün talep azalmasından dolayı ortaya çıkan işsizliktir.",
                            "children": [
                                {
                                    "name": "Resesyon",
                                    "description": "Ekonomik faaliyetlerde genel bir azalma ve işsizliğin artması dönemi."
                                },
                                {
                                    "name": "İşgücü Talebi",
                                    "description": "Ekonomik durgunluk dönemlerinde firmaların işgücü talebini azaltması."
                                }
                            ]
                        },
                        {
                            "name": "Friksiyonel İşsizlik",
                            "description": "İş değiştirme veya yeni iş arama sürecinde oluşan geçici işsizliktir.",
                            "children": [
                                {
                                    "name": "İş Arama Süreci",
                                    "description": "Yeni bir iş bulma sürecindeki zaman dilimi."
                                },
                                {
                                    "name": "İş Değiştirme",
                                    "description": "Mevcut işten yeni bir işe geçiş sürecinde oluşan geçici işsizlik."
                                }
                            ]
                        },
                        {
                            "name": "Mevsimsel İşsizlik",
                            "description": "Belirli mevsimlerde ortaya çıkan işsizlik türüdür. Örneğin tarım, turizm gibi sektörlerde görülebilir.",
                            "children": [
                                {
                                    "name": "Tarımda Mevsimsel İşsizlik",
                                    "description": "Tarım sektöründe hasat dönemleri dışında iş gücüne olan talebin azalması."
                                },
                                {
                                    "name": "Turizmde Mevsimsel İşsizlik",
                                    "description": "Turizm sektöründe yoğun sezon dışında iş fırsatlarının azalması."
                                }
                            ]
                        },
                        {
                            "name": "Uzun Süreli İşsizlik",
                            "description": "İşsizliğin uzun süre devam etmesi durumunda ortaya çıkan sorunlardır. Genellikle beceri kaybı ve motivasyon eksikliği ile ilişkilidir.",
                            "children": [
                                {
                                    "name": "Beceri Kaybı",
                                    "description": "Uzun süreli işsizliğin işgücü becerileri üzerindeki olumsuz etkisi."
                                },
                                {
                                    "name": "Motivasyon Eksikliği",
                                    "description": "Uzun süreli işsizliğin bireylerin iş arama motivasyonunu azaltması."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Cari Denge",
                    "description": "Bir ülkenin mal ve hizmet ihracatı ile ithalatı arasındaki farkı ifade eder. Pozitif cari denge ihracat fazlasını, negatif cari denge ithalat fazlasını gösterir.",
                    "children": [
                        {
                            "name": "Ticaret Dengesi",
                            "description": "Mal ve hizmet ticaretinden doğan cari denge kalemidir. İhracat ve ithalat arasındaki farkı içerir.",
                            "children": [
                                {
                                    "name": "Mal Ticaret Dengesi",
                                    "description": "Mal ihracatı ile mal ithalatı arasındaki fark."
                                },
                                {
                                    "name": "Hizmet Ticaret Dengesi",
                                    "description": "Hizmet ihracatı ile hizmet ithalatı arasındaki fark."
                                }
                            ]
                        },
                        {
                            "name": "Gelir Dengesi",
                            "description": "Yurtiçi gelirlerin yurtdışından gelen gelirlerle olan dengesini ifade eder.",
                            "children": [
                                {
                                    "name": "Birincil Gelir",
                                    "description": "Ülkeler arası işçi ücretleri ve yatırım gelirleri."
                                },
                                {
                                    "name": "İkincil Gelir",
                                    "description": "Transfer ödemeleri ve diğer cari işlemler."
                                }
                            ]
                        },
                        {
                            "name": "Transfer Dengesi",
                            "description": "Bir ülkeden diğerine yapılan tek taraflı transferleri kapsar. Yardımlar, emeklilik ödemeleri gibi kalemler içerir.",
                            "children": [
                                {
                                    "name": "Resmi Transferler",
                                    "description": "Hükümetler arası yapılan yardımlar ve hibeler."
                                },
                                {
                                    "name": "Özel Transferler",
                                    "description": "Bireyler arasında yapılan para transferleri ve bağışlar."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Bütçe Dengesi",
                    "description": "Hükümetin gelirleri ile harcamaları arasındaki dengeyi ifade eder. Fazla bütçe, gelirlerin harcamaları aştığı durumları; bütçe açığı, harcamaların gelirleri aştığı durumları gösterir.",
                    "children": [
                        {
                            "name": "Fiskal Denge",
                            "description": "Hükümetin toplam gelirlerinin toplam harcamalarına eşit olduğu durumdur.",
                            "children": [
                                {
                                    "name": "Gelir Kaynakları",
                                    "description": "Vergiler, harçlar ve diğer gelir kaynakları."
                                },
                                {
                                    "name": "Harcamalar",
                                    "description": "Kamu hizmetleri, altyapı yatırımları ve transfer ödemeleri."
                                }
                            ]
                        },
                        {
                            "name": "Bütçe Açığı",
                            "description": "Hükümetin harcamalarının gelirlerini aştığı durumdur. Genellikle borçlanma ile finanse edilir.",
                            "children": [
                                {
                                    "name": "Borçlanma Yöntemleri",
                                    "description": "Devlet tahvilleri, hazine bonoları ve diğer borçlanma araçları."
                                },
                                {
                                    "name": "Açığın Etkileri",
                                    "description": "Faiz oranları, yatırım ve enflasyon üzerindeki olası etkiler."
                                }
                            ]
                        },
                        {
                            "name": "Bütçe Fazlası",
                            "description": "Hükümetin gelirlerinin harcamalarını aştığı durumdur. Borç ödemede veya tasarruflarda kullanılabilir.",
                            "children": [
                                {
                                    "name": "Tasarruf Kullanımı",
                                    "description": "Bütçe fazlasının yatırım, borç ödemesi veya tasarruf fonlarına aktarılması."
                                },
                                {
                                    "name": "Yatırım Stratejileri",
                                    "description": "Fazla bütçenin altyapı projeleri veya sosyal programlara yönlendirilmesi."
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Ekonomi Politikaları",
            "description": "Ekonomiyi yönlendirmek ve istikrarı sağlamak için hükümetlerin uyguladığı stratejilerdir. Para politikası, maliye politikası, ticaret politikası ve yapısal politikalar gibi alanları kapsar.",
            "children": [
                {
                    "name": "Para Politikası",
                    "description": "Merkez bankası tarafından yürütülen, para arzını ve faiz oranlarını kontrol ederek ekonomik istikrarı sağlamayı amaçlayan politikadır.",
                    "children": [
                        {
                            "name": "Faiz Oranları",
                            "description": "Para politikasının ana araçlarından biridir. Faiz oranlarının değiştirilmesi, tüketim ve yatırım kararlarını etkiler.",
                            "children": [
                                {
                                    "name": "Kısa Vadeli Faiz Oranları",
                                    "description": "Merkez bankasının belirlediği kısa vadeli faiz oranları."
                                },
                                {
                                    "name": "Uzun Vadeli Faiz Oranları",
                                    "description": "Piyasa koşullarına bağlı olarak belirlenen uzun vadeli faiz oranları."
                                }
                            ]
                        },
                        {
                            "name": "Para Arzı",
                            "description": "Ekonomide dolaşımdaki para miktarını ifade eder. Artırılması veya azaltılması ekonomik aktiviteyi etkiler.",
                            "children": [
                                {
                                    "name": "M1 Para Arzı",
                                    "description": "Nakit para ve vadesiz mevduatlar gibi likit para bileşenleri."
                                },
                                {
                                    "name": "M2 Para Arzı",
                                    "description": "M1'e ek olarak vadeli mevduatlar ve kısa vadeli para piyasası araçları."
                                },
                                {
                                    "name": "M3 Para Arzı",
                                    "description": "M2'ye ek olarak büyük mevduatlar ve diğer geniş para bileşenleri."
                                }
                            ]
                        },
                        {
                            "name": "Zorunlu Karşılıklar",
                            "description": "Bankaların merkez bankasında tutmaları gereken rezerv oranlarıdır. Para arzını kontrol etmek için kullanılır.",
                            "children": [
                                {
                                    "name": "Zorunlu Karşılık Oranları",
                                    "description": "Bankaların mevduatlarının belirli bir yüzdesini merkez bankasında tutmaları zorunluluğu."
                                },
                                {
                                    "name": "Rezerv Yönetimi",
                                    "description": "Merkez bankasının zorunlu karşılık oranlarını değiştirerek para arzını düzenlemesi."
                                }
                            ]
                        },
                        {
                            "name": "Açık Piyasa İşlemleri",
                            "description": "Merkez bankasının menkul kıymet alım ve satımı yoluyla para arzını düzenlediği işlemlerdir.",
                            "children": [
                                {
                                    "name": "Menük Piyasasında Alım Satım",
                                    "description": "Merkez bankasının kısa vadeli menkul kıymetler alıp satması."
                                },
                                {
                                    "name": "Uzun Vadeli Yatırımlar",
                                    "description": "Merkez bankasının uzun vadeli menkul kıymetler alımı veya satımı."
                                }
                            ]
                        },
                        {
                            "name": "İletişim Politikası",
                            "description": "Merkez bankasının ekonomiye yönelik beklentileri yönlendirmek amacıyla kullandığı iletişim stratejileridir.",
                            "children": [
                                {
                                    "name": "Politika Açıklamaları",
                                    "description": "Merkez bankasının para politikası kararlarını kamuoyuna duyurması."
                                },
                                {
                                    "name": "Beklenti Yönetimi",
                                    "description": "Ekonomik aktörlerin beklentilerini şekillendirmek için yapılan açıklamalar."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Maliye Politikası",
                    "description": "Hükümetin bütçe harcamaları ve vergiler aracılığıyla ekonomik aktiviteyi düzenlemesini ifade eder.",
                    "children": [
                        {
                            "name": "Kamu Harcamaları",
                            "description": "Hükümetin altyapı, eğitim, sağlık gibi alanlara yaptığı harcamalardır. Ekonomiyi canlandırmada kullanılır.",
                            "children": [
                                {
                                    "name": "Altyapı Yatırımları",
                                    "description": "Ulaşım, enerji ve iletişim gibi temel altyapı alanlarına yapılan yatırımlar."
                                },
                                {
                                    "name": "Sosyal Harcamalar",
                                    "description": "Eğitim, sağlık ve sosyal güvenlik gibi sosyal hizmetlere yapılan harcamalar."
                                }
                            ]
                        },
                        {
                            "name": "Vergiler",
                            "description": "Hükümetin gelir elde etmek için vatandaşlardan ve firmalardan aldığı zorunlu ödemelerdir. Tüketim ve yatırım kararlarını etkiler.",
                            "children": [
                                {
                                    "name": "Doğrudan Vergiler",
                                    "description": "Gelire ve servete dayalı vergiler (örneğin, gelir vergisi, kurumlar vergisi)."
                                },
                                {
                                    "name": "Dolaylı Vergiler",
                                    "description": "Tüketim üzerinden alınan vergiler (örneğin, KDV, ÖTV)."
                                },
                                {
                                    "name": "Vergi Teşvikleri",
                                    "description": "Belirli sektörleri veya yatırımları teşvik etmek amacıyla uygulanan vergi indirimleri ve muafiyetleri."
                                }
                            ]
                        },
                        {
                            "name": "Transfer Ödemeleri",
                            "description": "Hükümetin sosyal yardımlar, emeklilik ödemeleri gibi doğrudan bireylere yaptığı ödemelerdir.",
                            "children": [
                                {
                                    "name": "Sosyal Yardımlar",
                                    "description": "Gelir desteği, işsizlik yardımları ve sosyal yardım programları."
                                },
                                {
                                    "name": "Emeklilik Ödemeleri",
                                    "description": "Devlet tarafından sağlanan emeklilik maaşları ve faydaları."
                                }
                            ]
                        },
                        {
                            "name": "Bütçe Disiplini",
                            "description": "Hükümetin maliye politikasını sürdürülebilir kılmak için uyguladığı bütçe yönetim stratejileridir.",
                            "children": [
                                {
                                    "name": "Borç Yönetimi",
                                    "description": "Devlet borcunun kontrol altında tutulması ve yönetilmesi stratejileri."
                                },
                                {
                                    "name": "Harcamaların Etkin Yönetimi",
                                    "description": "Kamu harcamalarının verimliliğinin artırılması ve israfın önlenmesi."
                                }
                            ]
                        },
                        {
                            "name": "Vergi Politikası",
                            "description": "Gelir dağılımını düzenlemek ve ekonomik etkinliği artırmak amacıyla uygulanan vergi oranları ve yapılarıdır.",
                            "children": [
                                {
                                    "name": "Progresif Vergilendirme",
                                    "description": "Gelir düzeyi arttıkça vergi oranlarının da arttığı vergi sistemi."
                                },
                                {
                                    "name": "Oransal Vergilendirme",
                                    "description": "Gelir düzeyinden bağımsız olarak aynı vergi oranının uygulandığı sistem."
                                },
                                {
                                    "name": "Regresif Vergilendirme",
                                    "description": "Gelir düzeyi arttıkça vergi oranlarının azaldığı vergi sistemi."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Ticaret Politikası",
                    "description": "Ülkeler arasındaki ticaret ilişkilerini düzenleyen politikaları ifade eder. Gümrük tarifeleri, ithalat kotaları ve serbest ticaret anlaşmaları gibi araçları içerir.",
                    "children": [
                        {
                            "name": "Gümrük Tarifeleri",
                            "description": "İthal edilen mal ve hizmetlere uygulanan vergilerdir. Koruma veya gelir elde etme amacı taşır.",
                            "children": [
                                {
                                    "name": "Tarife Vergileri",
                                    "description": "İthal edilen ürünlerin birim başına uygulanan sabit vergiler."
                                },
                                {
                                    "name": "Oransal Vergiler",
                                    "description": "İthal edilen ürünlerin fiyatı üzerinden belirli bir oranla uygulanan vergiler."
                                }
                            ]
                        },
                        {
                            "name": "İthalat Kotaları",
                            "description": "Belirli mal ve hizmetlerin ithalat miktarını sınırlayan politikadır. Yerli üretimi korumak için kullanılır.",
                            "children": [
                                {
                                    "name": "Katı Kotalar",
                                    "description": "İthalat miktarının kesin bir sınırla belirlendiği kotalar."
                                },
                                {
                                    "name": "Esnek Kotalar",
                                    "description": "Piyasa koşullarına bağlı olarak değişebilen ithalat kotaları."
                                }
                            ]
                        },
                        {
                            "name": "Serbest Ticaret Anlaşmaları",
                            "description": "İki veya daha fazla ülke arasında ticaret engellerini kaldırmayı amaçlayan anlaşmalardır. Ticaret hacmini artırır.",
                            "children": [
                                {
                                    "name": "Bölgesel Serbest Ticaret Anlaşmaları",
                                    "description": "Belirli bir coğrafi bölge içinde yapılan serbest ticaret anlaşmaları."
                                },
                                {
                                    "name": "Çok Taraflı Serbest Ticaret Anlaşmaları",
                                    "description": "Birden fazla ülkenin katıldığı küresel serbest ticaret anlaşmaları."
                                }
                            ]
                        },
                        {
                            "name": "İhracat Teşvikleri",
                            "description": "Ülke dışına mal ve hizmet satımını artırmak için sağlanan vergi indirimleri, sübvansiyonlar ve kredilerdir.",
                            "children": [
                                {
                                    "name": "Vergi İndirimleri",
                                    "description": "İhracat yapan firmalara sağlanan vergi indirimi ve muafiyetler."
                                },
                                {
                                    "name": "Sübvansiyonlar",
                                    "description": "İhracatı teşvik etmek için sağlanan doğrudan mali destekler."
                                },
                                {
                                    "name": "İhracat Kredileri",
                                    "description": "İhracatçı firmalara düşük faizli krediler sağlanması."
                                }
                            ]
                        },
                        {
                            "name": "Dış Ticaret Dengeleme",
                            "description": "İthalat ve ihracat arasındaki dengeyi sağlamak için uygulanan politikaları kapsar.",
                            "children": [
                                {
                                    "name": "Döviz Kuru Yönetimi",
                                    "description": "İthalat ve ihracat dengesini sağlamak için döviz kurlarının yönetilmesi."
                                },
                                {
                                    "name": "İthalat Kontrolleri",
                                    "description": "İthalat miktarını sınırlamak için uygulanan kotalar ve tarifeler."
                                },
                                {
                                    "name": "İhracat Destekleri",
                                    "description": "İhracatın artırılması için sağlanan finansal ve teknik destekler."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Yapısal Politikalar",
                    "description": "Ekonominin uzun vadeli verimliliğini ve rekabetçiliğini artırmak amacıyla uygulanan politikaları ifade eder. Eğitim, teknoloji, iş gücü piyasası reformları gibi alanları kapsar.",
                    "children": [
                        {
                            "name": "Eğitim Politikaları",
                            "description": "İşgücünün beceri seviyesini artırmak için uygulanan eğitim ve öğretim stratejileridir.",
                            "children": [
                                {
                                    "name": "Temel Eğitim",
                                    "description": "Okul öncesi, ilköğretim ve ortaöğretim seviyelerindeki eğitim politikaları."
                                },
                                {
                                    "name": "Yükseköğretim",
                                    "description": "Üniversiteler ve yüksekokullar aracılığıyla sağlanan ileri düzey eğitim programları."
                                },
                                {
                                    "name": "Mesleki Eğitim",
                                    "description": "İşgücü piyasasının ihtiyaçlarına yönelik mesleki ve teknik eğitim programları."
                                }
                            ]
                        },
                        {
                            "name": "Teknoloji ve Ar-Ge Politikaları",
                            "description": "Araştırma ve geliştirmeyi teşvik ederek teknolojik ilerlemeyi destekleyen politikalardır.",
                            "children": [
                                {
                                    "name": "Ar-Ge Finansmanı",
                                    "description": "Araştırma ve geliştirme projelerine sağlanan mali destekler."
                                },
                                {
                                    "name": "Teknoloji Transferi",
                                    "description": "Üniversiteler ve araştırma kurumları ile sanayi arasındaki bilgi transferi süreçleri."
                                },
                                {
                                    "name": "İnovasyon Teşvikleri",
                                    "description": "Yenilikçi projeleri ve girişimleri desteklemek için sağlanan vergi indirimleri ve hibeler."
                                }
                            ]
                        },
                        {
                            "name": "İş Gücü Piyasası Reformları",
                            "description": "İş piyasasının esnekliğini artırmak ve istihdamı kolaylaştırmak için yapılan düzenlemelerdir.",
                            "children": [
                                {
                                    "name": "Esnek Çalışma Düzenlemeleri",
                                    "description": "Esnek çalışma saatleri ve iş güvencesi sağlayan düzenlemeler."
                                },
                                {
                                    "name": "İşsizlik Sigortası Reformları",
                                    "description": "İşsiz bireylere yönelik sosyal güvenlik sistemlerinin iyileştirilmesi."
                                },
                                {
                                    "name": "İşgücü Mobilitesi",
                                    "description": "İşgücünün farklı sektörler ve coğrafi bölgeler arasında daha kolay hareket edebilmesi için yapılan düzenlemeler."
                                }
                            ]
                        },
                        {
                            "name": "Altyapı Yatırımları",
                            "description": "Ulaşım, enerji ve iletişim gibi temel altyapı alanlarına yapılan yatırımlardır.",
                            "children": [
                                {
                                    "name": "Ulaşım Altyapısı",
                                    "description": "Yollar, demiryolları, havaalanları ve limanlar gibi ulaşım ağlarının geliştirilmesi."
                                },
                                {
                                    "name": "Enerji Altyapısı",
                                    "description": "Elektrik santralleri, dağıtım ağları ve yenilenebilir enerji kaynaklarının entegrasyonu."
                                },
                                {
                                    "name": "İletişim Altyapısı",
                                    "description": "Telekomünikasyon ağları ve internet altyapısının güçlendirilmesi."
                                }
                            ]
                        },
                        {
                            "name": "Regülasyon Politikaları",
                            "description": "Piyasa düzenlemeleri ve denetim mekanizmaları ile ekonomik faaliyetlerin yönlendirilmesini sağlar.",
                            "children": [
                                {
                                    "name": "Rekabet Politikaları",
                                    "description": "Monopol ve oligopol durumlarını önlemek için rekabeti teşvik eden düzenlemeler."
                                },
                                {
                                    "name": "Çevre Regülasyonları",
                                    "description": "Çevresel standartların sağlanması için uygulanan düzenlemeler."
                                },
                                {
                                    "name": "Finansal Regülasyonlar",
                                    "description": "Finansal piyasalarda istikrarı sağlamak için uygulanan denetim ve düzenlemeler."
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Toplam Talep ve Arz",
            "description": "Ekonomideki toplam talep ve toplam arzın dengesi, fiyat düzeyi ve üretim miktarını belirler. Bu denge, ekonomik büyüme ve istikrar için kritiktir.",
            "children": [
                {
                    "name": "Toplam Talep Bileşenleri",
                    "description": "Ekonomideki toplam talebi oluşturan unsurlardır.",
                    "children": [
                        {
                            "name": "Tüketim",
                            "description": "Hanehalklarının mal ve hizmetlere harcadığı toplam harcamadır. Ekonominin en büyük bileşenidir.",
                            "children": [
                                {
                                    "name": "Dayanıklı Tüketim",
                                    "description": "Otomobil, beyaz eşya gibi uzun ömürlü mallara yapılan harcamalar."
                                },
                                {
                                    "name": "Dayanıksız Tüketim",
                                    "description": "Gıda, giyim gibi kısa ömürlü mallara yapılan harcamalar."
                                },
                                {
                                    "name": "Hizmet Tüketimi",
                                    "description": "Sağlık, eğitim, eğlence gibi hizmetlere yapılan harcamalar."
                                }
                            ]
                        },
                        {
                            "name": "Yatırım",
                            "description": "Firmaların üretim kapasitesini artırmak için yaptığı harcamalardır. İnşaat, makineler ve teknoloji yatırımlarını içerir.",
                            "children": [
                                {
                                    "name": "Sabit Sermaye Yatırımları",
                                    "description": "Makine, bina gibi uzun vadeli üretim araçlarına yapılan yatırımlar."
                                },
                                {
                                    "name": "Stok Yatırımları",
                                    "description": "Firma stoklarında biriken mal ve hammadde miktarının artırılması."
                                },
                                {
                                    "name": "Araştırma ve Geliştirme (Ar-Ge)",
                                    "description": "Yeni ürün ve süreçlerin geliştirilmesi için yapılan yatırımlar."
                                }
                            ]
                        },
                        {
                            "name": "Kamu Harcamaları",
                            "description": "Devletin mal ve hizmet alımlarıdır. Altyapı, eğitim ve sağlık gibi kamu hizmetlerine yapılan harcamaları kapsar.",
                            "children": [
                                {
                                    "name": "Kamu Hizmetleri Harcamaları",
                                    "description": "Eğitim, sağlık, güvenlik gibi kamu hizmetlerine yapılan harcamalar."
                                },
                                {
                                    "name": "Altyapı Harcamaları",
                                    "description": "Yollar, köprüler, enerji projeleri gibi altyapı yatırımlarına yapılan harcamalar."
                                },
                                {
                                    "name": "Savunma Harcamaları",
                                    "description": "Askeri teçhizat, personel ve savunma projelerine yapılan harcamalar."
                                }
                            ]
                        },
                        {
                            "name": "Net İhracat",
                            "description": "İhracattan ithalatın çıkarılmasıyla bulunan değerdir. Bir ülkenin dış ticaret performansını gösterir.",
                            "children": [
                                {
                                    "name": "İhracatın Artırılması",
                                    "description": "Ürün ve hizmetlerin yurtdışına satışının artırılması stratejileri."
                                },
                                {
                                    "name": "İthalatın Azaltılması",
                                    "description": "Yurtdışından mal ve hizmet ithalatının azaltılması politikaları."
                                },
                                {
                                    "name": "Ticaret Dengesizlikleri",
                                    "description": "Net ihracatın negatif veya pozitif olmasının ekonomik etkileri."
                                }
                            ]
                        },
                        {
                            "name": "Tüketici Güveni",
                            "description": "Tüketicilerin ekonomik geleceğe yönelik beklentileri ve harcama eğilimlerini yansıtan göstergedir.",
                            "children": [
                                {
                                    "name": "Güven Endeksleri",
                                    "description": "Tüketici güvenini ölçen istatistiki göstergeler."
                                },
                                {
                                    "name": "Harcamaya Yönelik Eğilimler",
                                    "description": "Tüketicilerin gelecekteki harcama planlarına dair beklentileri."
                                }
                            ]
                        },
                        {
                            "name": "İş Yatırımcı Güveni",
                            "description": "İşletmelerin geleceğe yönelik yatırım kararlarını etkileyen güven düzeyidir.",
                            "children": [
                                {
                                    "name": "İş Ortamı Değerlendirmeleri",
                                    "description": "İşletmelerin mevcut ekonomik koşullara dair algıları."
                                },
                                {
                                    "name": "Yatırım Planları",
                                    "description": "İşletmelerin gelecekteki yatırımlara dair planları ve beklentileri."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Toplam Arz",
                    "description": "Ekonomideki toplam üretim kapasitesini ifade eder. Fiyat düzeyi ve üretim miktarı üzerinde etkisi vardır.",
                    "children": [
                        {
                            "name": "Kısa Dönem Arz",
                            "description": "Fiyat düzeyindeki değişikliklerin üretim miktarını etkilediği dönemi ifade eder. Esneklik daha yüksektir.",
                            "children": [
                                {
                                    "name": "Fiyat Esnekliği",
                                    "description": "Fiyat değişikliklerinin üretim miktarına olan etkisi."
                                },
                                {
                                    "name": "Üretim Faktörlerinin Esnekliği",
                                    "description": "Üretim faktörlerinin kısa dönemde ne kadar esnek olduğu."
                                }
                            ]
                        },
                        {
                            "name": "Uzun Dönem Arz",
                            "description": "Ekonominin üretim kapasitesinin tam istihdam seviyesine ulaştığı dönemi ifade eder. Esneklik düşüktür.",
                            "children": [
                                {
                                    "name": "Doğal Üretim Seviyesi",
                                    "description": "Ekonominin uzun vadede sürdürebileceği maksimum üretim kapasitesi."
                                },
                                {
                                    "name": "Potansiyel GSYH",
                                    "description": "Ekonominin kaynaklarını tam ve verimli kullanarak ulaşabileceği üretim seviyesidir."
                                }
                            ]
                        },
                        {
                            "name": "Doğal Üretim Seviyesi",
                            "description": "Ekonominin uzun vadede sürdürebileceği maksimum üretim kapasitesidir.",
                            "children": [
                                {
                                    "name": "Tam İstihdam",
                                    "description": "Ekonomide tüm kaynakların verimli kullanıldığı, işsizliğin doğal seviyede olduğu durum."
                                },
                                {
                                    "name": "Üretim Faktörleri",
                                    "description": "Emek, sermaye ve doğal kaynakların verimli kullanımı."
                                }
                            ]
                        },
                        {
                            "name": "Potansiyel GSYH",
                            "description": "Ekonominin kaynaklarını tam ve verimli kullanarak ulaşabileceği üretim seviyesidir.",
                            "children": [
                                {
                                    "name": "Kaynak Verimliliği",
                                    "description": "Üretim faktörlerinin en etkin şekilde kullanılması."
                                },
                                {
                                    "name": "Teknolojik Gelişmeler",
                                    "description": "Üretim süreçlerindeki teknolojik yeniliklerin potansiyel GSYH'ye etkisi."
                                }
                            ]
                        },
                        {
                            "name": "Teknolojik İlerleme",
                            "description": "Üretim süreçlerindeki yenilikler ve verimlilik artışları, toplam arzı artırır.",
                            "children": [
                                {
                                    "name": "Üretim Teknolojileri",
                                    "description": "Yeni üretim teknikleri ve makinelerin geliştirilmesi."
                                },
                                {
                                    "name": "Dijital Dönüşüm",
                                    "description": "İş süreçlerinde dijital teknolojilerin entegrasyonu."
                                }
                            ]
                        },
                        {
                            "name": "İşgücü Verimliliği",
                            "description": "Birim işgücü başına üretilen mal ve hizmet miktarını ifade eder. Artışı toplam arzı yükseltir.",
                            "children": [
                                {
                                    "name": "Eğitim ve Gelişim",
                                    "description": "İşgücünün beceri ve bilgi seviyesinin artırılması."
                                },
                                {
                                    "name": "İş Yerinde İnovasyon",
                                    "description": "Üretim süreçlerinde yenilikçi yöntemlerin uygulanması."
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Uluslararası Ekonomi",
            "description": "Ülkeler arası ticaret ve finans ilişkilerini inceleyen iktisat dalıdır. Dış ticaret, döviz piyasaları, küresel finans ve uluslararası ticaret politikalarını kapsar.",
            "children": [
                {
                    "name": "Döviz Kurları",
                    "description": "Farklı ülkelerin para birimlerinin birbirine karşı değerini ifade eder. Döviz kurları, uluslararası ticaret ve yatırım üzerinde önemli etkiye sahiptir.",
                    "children": [
                        {
                            "name": "Sabit Döviz Kurları",
                            "description": "Bir para biriminin başka bir para birimine sabit bir oranda bağlı olduğu sistemdir.",
                            "children": [
                                {
                                    "name": "Sabit Kur Rejim Türleri",
                                    "description": "Tam sabit, bantlı sabit ve para birimi üzerinde müdahalelerle desteklenen sabit kurlar."
                                },
                                {
                                    "name": "Merkez Bankası Müdahaleleri",
                                    "description": "Döviz kuru sabit tutulurken merkez bankasının döviz alım-satımı yapması."
                                }
                            ]
                        },
                        {
                            "name": "Esnek Döviz Kurları",
                            "description": "Piyasa koşullarına göre döviz kurlarının serbestçe belirlendiği sistemdir.",
                            "children": [
                                {
                                    "name": "Serbest Kur Rejim Türleri",
                                    "description": "Tam esnek, yönetilen dalgalı ve hedeflenen esneklik seviyeleri."
                                },
                                {
                                    "name": "Piyasa Faktörleri",
                                    "description": "Arz ve talep dengesi, faiz oranları ve ekonomik göstergeler."
                                }
                            ]
                        },
                        {
                            "name": "Döviz Kuru Regime Türleri",
                            "description": "Sabit, esnek ve yönetilen dalgalı döviz kuru sistemlerini içerir.",
                            "children": [
                                {
                                    "name": "Bantlı Döviz Kuru Rejimi",
                                    "description": "Döviz kurlarının belirli bir bant içinde dalgalandığı sistem."
                                },
                                {
                                    "name": "Para Birimi Bağlama",
                                    "description": "Bir para biriminin başka bir güçlü para birimine sabitlenmesi."
                                }
                            ]
                        },
                        {
                            "name": "Döviz Rezervleri",
                            "description": "Bir ülkenin merkez bankasında tutulan yabancı para birimleri ve altın rezervleridir.",
                            "children": [
                                {
                                    "name": "Rezerv Para Birimleri",
                                    "description": "USD, EUR, JPY gibi uluslararası kabul görmüş para birimleri."
                                },
                                {
                                    "name": "Altın Rezervleri",
                                    "description": "Merkez bankalarının sahip olduğu altın miktarı."
                                }
                            ]
                        },
                        {
                            "name": "Döviz Kuru Politikaları",
                            "description": "Merkez bankalarının döviz kurlarını etkilemek için kullandığı araçlar ve stratejilerdir.",
                            "children": [
                                {
                                    "name": "Döviz Müdahaleleri",
                                    "description": "Merkez bankasının döviz alım-satımı yaparak kuru etkilemesi."
                                },
                                {
                                    "name": "Para Politikası Entegrasyonu",
                                    "description": "Faiz oranları ve para arzı ile döviz kuru arasındaki ilişkiyi yönetme."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Ödemeler Dengesi",
                    "description": "Bir ülkenin diğer ülkelerle yaptığı tüm ekonomik işlemlerin kaydını tutar. Cari işlemler, sermaye hesabı ve finans hesabını içerir.",
                    "children": [
                        {
                            "name": "Cari İşlemler",
                            "description": "Mal ve hizmet ticareti, gelir transferleri gibi cari hesap kalemlerini içerir.",
                            "children": [
                                {
                                    "name": "Mal Dengesi",
                                    "description": "İthalat ve ihracat arasındaki fark."
                                },
                                {
                                    "name": "Hizmet Dengesi",
                                    "description": "Hizmet ihracatı ve ithalatı arasındaki fark."
                                },
                                {
                                    "name": "Birincil Gelir",
                                    "description": "Yurtdışından elde edilen gelirler ve yurtiçinden yurtdışına yapılan ödemeler."
                                },
                                {
                                    "name": "İkincil Gelir",
                                    "description": "Tek taraflı transferler ve yardım ödemeleri."
                                }
                            ]
                        },
                        {
                            "name": "Sermaye Hesabı",
                            "description": "Yabancı yatırımlar, portföy yatırımları gibi sermaye hareketlerini kapsar.",
                            "children": [
                                {
                                    "name": "Doğrudan Yatırım",
                                    "description": "Yurtdışında faaliyet gösteren işletmelere yapılan yatırımlar."
                                },
                                {
                                    "name": "Portföy Yatırımları",
                                    "description": "Hisse senetleri, tahviller ve diğer finansal araçlara yapılan yatırımlar."
                                },
                                {
                                    "name": "Diğer Sermaye Hareketleri",
                                    "description": "Borçlanma ve diğer sermaye transferleri."
                                }
                            ]
                        },
                        {
                            "name": "Finans Hesabı",
                            "description": "Finansal varlık ve borçların uluslararası transferlerini içerir.",
                            "children": [
                                {
                                    "name": "Finansal Varlıklar",
                                    "description": "Hisse senetleri, tahviller ve diğer finansal araçlar."
                                },
                                {
                                    "name": "Finansal Borçlar",
                                    "description": "Uluslararası borçlanmalar ve krediler."
                                },
                                {
                                    "name": "Finansal Transferler",
                                    "description": "Finansal varlıkların alım-satımı ve borç transferleri."
                                }
                            ]
                        },
                        {
                            "name": "İlk Transferler",
                            "description": "Tek taraflı ve geri alınamaz transferleri kapsar. Yardımlar ve bağışlar bu kapsama girer.",
                            "children": [
                                {
                                    "name": "Resmi İlk Transferler",
                                    "description": "Hükümetler arası yapılan resmi yardımlar ve hibeler."
                                },
                                {
                                    "name": "Özel İlk Transferler",
                                    "description": "Bireyler arasında yapılan bağışlar ve gönüllü yardımlar."
                                }
                            ]
                        },
                        {
                            "name": "Portföy Yatırımları",
                            "description": "Hisse senetleri, tahviller ve diğer finansal araçlara yapılan yatırımları ifade eder.",
                            "children": [
                                {
                                    "name": "Hisse Senedi Yatırımları",
                                    "description": "Şirket hisselerine yapılan yatırımlar."
                                },
                                {
                                    "name": "Tahvil Yatırımları",
                                    "description": "Devlet ve şirket tahvillerine yapılan yatırımlar."
                                },
                                {
                                    "name": "Diğer Finansal Araçlar",
                                    "description": "Vadeli işlemler, opsiyonlar ve diğer türev araçlar."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Küresel Ticaret",
                    "description": "Ülkeler arasındaki mal ve hizmet ticaretini ifade eder. Küresel ticaret, ekonomik büyüme, istihdam ve teknoloji transferi üzerinde önemli etkilere sahiptir.",
                    "children": [
                        {
                            "name": "Serbest Ticaret Bölgesi",
                            "description": "Üye ülkeler arasında ticaretin serbest olduğu ve tarifelerin kaldırıldığı bölgelerdir.",
                            "children": [
                                {
                                    "name": "Bölgesel Serbest Ticaret Anlaşmaları",
                                    "description": "Belirli bir coğrafi bölgede yapılan serbest ticaret anlaşmaları."
                                },
                                {
                                    "name": "Tek Bir Gümrük Tarifi",
                                    "description": "Serbest ticaret bölgesine üye ülkeler arasında ortak gümrük tarifeleri uygulama."
                                }
                            ]
                        },
                        {
                            "name": "Gümrük Birliği",
                            "description": "Üye ülkeler arasında serbest ticaretin yanı sıra ortak gümrük tarifeleri uygulanan bir bölgedir.",
                            "children": [
                                {
                                    "name": "Ortak Gümrük Tarifeleri",
                                    "description": "Üye ülkeler arasında uygulanan ortak ithalat vergileri."
                                },
                                {
                                    "name": "Ticaret Engellerinin Kaldırılması",
                                    "description": "Gümrük tarifeleri ve kotaların serbest ticaret bölgesine dahil edilmesi."
                                }
                            ]
                        },
                        {
                            "name": "Korumacı Ticaret Politikaları",
                            "description": "İç pazarı korumak amacıyla uygulanan ithalat kotaları, gümrük tarifeleri gibi politikalardır.",
                            "children": [
                                {
                                    "name": "Koruyucu Gümrük Tarifeleri",
                                    "description": "İthal edilen mallara yüksek vergiler uygulanarak yerli üretimin korunması."
                                },
                                {
                                    "name": "İthalat Kotaları",
                                    "description": "Belirli mal ve hizmetlerin ithalat miktarının sınırlandırılması."
                                }
                            ]
                        },
                        {
                            "name": "Dijital Ticaret",
                            "description": "İnternet ve dijital teknolojiler üzerinden gerçekleştirilen ticareti ifade eder.",
                            "children": [
                                {
                                    "name": "E-Ticaret Platformları",
                                    "description": "Amazon, Alibaba gibi dijital ticaret platformlarının rolü."
                                },
                                {
                                    "name": "Dijital Hizmetler",
                                    "description": "Yazılım, bulut hizmetleri ve dijital içerik ticareti."
                                }
                            ]
                        },
                        {
                            "name": "Ticaret Savaşları",
                            "description": "Ülkeler arasındaki ticaret politikalarının gerginleşmesi sonucu ortaya çıkan korumacı hamlelerdir.",
                            "children": [
                                {
                                    "name": "Tarife Artışları",
                                    "description": "İthalat vergilerinin artırılmasıyla karşılık verilmesi."
                                },
                                {
                                    "name": "Karşı Tarife Önlemleri",
                                    "description": "İhracat vergilerinin artırılması veya ithal edilen malların kısıtlanması."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Uluslararası Finans",
                    "description": "Uluslararası finansal piyasalar, döviz piyasaları ve uluslararası yatırımların yönetimi ile ilgilenir.",
                    "children": [
                        {
                            "name": "Uluslararası Yatırım Akışları",
                            "description": "Ülkeler arasındaki sermaye hareketlerini ifade eder. Doğrudan yabancı yatırım ve portföy yatırımları bu kapsama girer.",
                            "children": [
                                {
                                    "name": "Doğrudan Yabancı Yatırım",
                                    "description": "Bir ülkenin şirketlerinin başka bir ülkede doğrudan yatırım yapması."
                                },
                                {
                                    "name": "Portföy Yatırımları",
                                    "description": "Hisse senetleri ve tahviller gibi finansal araçlara yapılan yatırımlar."
                                },
                                {
                                    "name": "Diğer Yatırım Akışları",
                                    "description": "Kısa vadeli krediler, ticari krediler ve diğer finansal araçlara yapılan yatırımlar."
                                }
                            ]
                        },
                        {
                            "name": "Küresel Finansal Kurumlar",
                            "description": "Dünya Bankası, IMF gibi uluslararası finansal kuruluşların rolünü ve etkisini kapsar.",
                            "children": [
                                {
                                    "name": "Dünya Bankası",
                                    "description": "Gelişmekte olan ülkelere altyapı projeleri için finansman sağlayan uluslararası kuruluş."
                                },
                                {
                                    "name": "Uluslararası Para Fonu (IMF)",
                                    "description": "Ülkelerin ekonomik istikrarını desteklemek ve finansal krizleri önlemek amacıyla kurulan kuruluş."
                                },
                                {
                                    "name": "Bölgesel Finans Kuruluşları",
                                    "description": "Asya Kalkınma Bankası, Avrupa İmar Bankası gibi bölgesel odaklı finansal kurumlar."
                                }
                            ]
                        },
                        {
                            "name": "Döviz Riski Yönetimi",
                            "description": "Kur dalgalanmalarından kaynaklanan riskleri minimize etmek için kullanılan finansal araçlar ve stratejilerdir.",
                            "children": [
                                {
                                    "name": "Vadeli İşlemler",
                                    "description": "Belirli bir tarihte belirli bir döviz kuru üzerinden alım-satım yapılmasını sağlayan sözleşmeler."
                                },
                                {
                                    "name": "Opsiyonlar",
                                    "description": "Belirli bir tarihte veya öncesinde belirli bir döviz kuru üzerinden alım veya satım yapma hakkı veren finansal araçlar."
                                },
                                {
                                    "name": "Swap Sözleşmeleri",
                                    "description": "İki tarafın belirli bir süre boyunca nakit akışlarını değiştirmeyi kabul ettiği sözleşmeler."
                                }
                            ]
                        },
                        {
                            "name": "Küresel Finansal Krizler",
                            "description": "Finansal piyasalarda yaşanan büyük dalgalanmalar ve krizlerin nedenlerini ve etkilerini inceler.",
                            "children": [
                                {
                                    "name": "Finansal Balonlar",
                                    "description": "Mülk, hisse senetleri veya diğer varlıkların aşırı değer kazanması sonucu patlayan balonlar."
                                },
                                {
                                    "name": "Bankacılık Krizleri",
                                    "description": "Bankaların iflas etmesi veya likidite sorunları yaşaması durumları."
                                },
                                {
                                    "name": "Küresel Denge Bozulmaları",
                                    "description": "Ülkeler arasındaki makroekonomik dengesizliklerin finansal krizlere yol açması."
                                }
                            ]
                        },
                        {
                            "name": "Uluslararası Vergilendirme",
                            "description": "Çifte vergilendirmeyi önlemek ve uluslararası gelir dağılımını düzenlemek için uygulanan vergi politikalarıdır.",
                            "children": [
                                {
                                    "name": "Çifte Vergilendirme Anlaşmaları",
                                    "description": "İki veya daha fazla ülke arasında aynı gelirin iki kez vergilendirilmesini önleyen anlaşmalar."
                                },
                                {
                                    "name": "Vergi Kaçakçılığı ile Mücadele",
                                    "description": "Uluslararası vergi kaçakçılığını önlemek için uygulanan düzenlemeler."
                                },
                                {
                                    "name": "Transfer Fiyatlandırması",
                                    "description": "Çok uluslu şirketlerin iştirakler arası fiyatlandırma politikalarının düzenlenmesi."
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Ekonomik Büyüme",
            "description": "Bir ekonominin zaman içinde üretim kapasitesinin ve gelir düzeyinin artışıdır. Ekonomik büyüme, yaşam standardını yükseltir ve iş olanaklarını artırır.",
            "children": [
                {
                    "name": "Büyüme Faktörleri",
                    "description": "Ekonomik büyümeyi sağlayan ana unsurlardır.",
                    "children": [
                        {
                            "name": "Fiziki Sermaye",
                            "description": "Makine, bina gibi üretim araçlarının miktarı ve kalitesidir. Sermaye yatırımları büyümeyi destekler.",
                            "children": [
                                {
                                    "name": "Sermaye Birikimi",
                                    "description": "Üretim araçlarının artırılması için yapılan yatırımlar."
                                },
                                {
                                    "name": "Sermaye Depreciasyonu",
                                    "description": "Mevcut sermayenin aşınma ve yıpranma sonucu değer kaybetmesi."
                                }
                            ]
                        },
                        {
                            "name": "Beşeri Sermaye",
                            "description": "İşgücünün eğitimi ve becerileridir. Eğitim ve sağlık yatırımları beşeri sermayeyi artırır.",
                            "children": [
                                {
                                    "name": "Eğitim Seviyesi",
                                    "description": "İşgücünün eğitim düzeyinin ekonomik büyümeye etkisi."
                                },
                                {
                                    "name": "Sağlık Yatırımları",
                                    "description": "İşgücünün sağlığının iyileştirilmesi ve üretkenliğinin artırılması."
                                }
                            ]
                        },
                        {
                            "name": "Teknoloji",
                            "description": "Üretim süreçlerindeki yenilikler ve verimlilik artışlarıdır. Teknolojik ilerleme büyümenin motorudur.",
                            "children": [
                                {
                                    "name": "Teknolojik Yenilikler",
                                    "description": "Yeni teknolojilerin geliştirilmesi ve uygulanması."
                                },
                                {
                                    "name": "Ar-Ge Faaliyetleri",
                                    "description": "Araştırma ve geliştirme projelerinin ekonomik büyümeye katkısı."
                                }
                            ]
                        },
                        {
                            "name": "Doğal Kaynaklar",
                            "description": "Ekonomide üretimde kullanılan doğal varlıklardır. Enerji, mineraller ve tarım arazileri bu kapsama girer.",
                            "children": [
                                {
                                    "name": "Enerji Kaynakları",
                                    "description": "Fosil yakıtlar, yenilenebilir enerji kaynakları ve enerji verimliliği."
                                },
                                {
                                    "name": "Mineral ve Madencilik",
                                    "description": "Mineral rezervlerinin keşfi ve madencilik faaliyetlerinin ekonomik etkisi."
                                }
                            ]
                        },
                        {
                            "name": "Girişimcilik",
                            "description": "Yeni iş fikirlerini hayata geçirme ve yenilikçi işletmeler kurma yeteneğidir.",
                            "children": [
                                {
                                    "name": "Girişimcilik Ekosistemi",
                                    "description": "Startuplar, yatırımcılar ve destekleyici kurumların oluşturduğu çevre."
                                },
                                {
                                    "name": "Yenilikçi İş Modelleri",
                                    "description": "Yeni iş yapış şekillerinin ve iş modellerinin ekonomik büyümeye katkısı."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Büyüme Teorileri",
                    "description": "Ekonomik büyümeyi açıklayan teorilerdir.",
                    "children": [
                        {
                            "name": "Klasik Büyüme Teorisi",
                            "description": "Ekonomik büyümenin birikim ve emek faktörlerine bağlı olduğunu savunur.",
                            "children": [
                                {
                                    "name": "Adam Smith ve Eliott",
                                    "description": "Klasik büyüme teorisinin öncüleri ve temel varsayımları."
                                },
                                {
                                    "name": "Sermaye Birikimi",
                                    "description": "Bir ekonominin büyümesinde sermaye birikiminin rolü."
                                }
                            ]
                        },
                        {
                            "name": "Neo-Klasik Büyüme Teorisi",
                            "description": "Teknolojik ilerlemenin büyümede merkezi bir rol oynadığını vurgular.",
                            "children": [
                                {
                                    "name": "Solow Büyüme Modeli",
                                    "description": "Sermaye, emek ve teknolojik ilerleme faktörlerini içeren büyüme modeli."
                                },
                                {
                                    "name": "Diminishing Returns",
                                    "description": "Sermaye ve emeğin verimlilikte azalan getirilerle büyümeye katkısı."
                                }
                            ]
                        },
                        {
                            "name": "İçsel Büyüme Teorisi",
                            "description": "Büyümenin ekonomik politikalar ve kurumlar tarafından belirlenebileceğini öne sürer.",
                            "children": [
                                {
                                    "name": "Yenilik ve Bilgi",
                                    "description": "Bilgi birikiminin ve inovasyonun büyümeye etkisi."
                                },
                                {
                                    "name": "Beşeri Sermaye",
                                    "description": "Eğitim ve beceri seviyesinin büyüme üzerindeki rolü."
                                }
                            ]
                        },
                        {
                            "name": "Endojen Büyüme Teorisi",
                            "description": "Araştırma ve geliştirme, eğitim gibi faktörlerin büyümeyi içsel olarak teşvik ettiğini belirtir.",
                            "children": [
                                {
                                    "name": "Teknoloji Dönüşümü",
                                    "description": "Ar-Ge ve inovasyon faaliyetlerinin ekonomik büyümeye katkısı."
                                },
                                {
                                    "name": "Bilişsel Sermaye",
                                    "description": "Bilgi ve becerilerin ekonomik büyümedeki önemi."
                                }
                            ]
                        },
                        {
                            "name": "Solow Büyüme Modeli",
                            "description": "Teknolojik ilerleme, sermaye birikimi ve işgücü büyümesinin ekonomik büyümedeki rolünü analiz eder.",
                            "children": [
                                {
                                    "name": "Sermaye Birikimi ve Tasarruf Oranları",
                                    "description": "Tasarruf oranlarının sermaye birikimine ve büyümeye etkisi."
                                },
                                {
                                    "name": "Teknolojik İlerleme",
                                    "description": "Teknoloji artışının üretim fonksiyonuna etkisi."
                                },
                                {
                                    "name": "Denge Durumu",
                                    "description": "Uzun vadeli büyüme dengesinin belirlenmesi."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Büyüme Endeksleri",
                    "description": "Ekonomik büyümeyi ölçmek için kullanılan göstergelerdir.",
                    "children": [
                        {
                            "name": "GSYH Büyüme Oranı",
                            "description": "GSYH'nın bir önceki yıla göre artış oranını ifade eder.",
                            "children": [
                                {
                                    "name": "Yıllık Büyüme Oranları",
                                    "description": "GSYH'nın yıllık bazda artış hızı."
                                },
                                {
                                    "name": "Çeyrek Bazlı Büyüme Oranları",
                                    "description": "GSYH'nın çeyrek bazında artış hızı."
                                }
                            ]
                        },
                        {
                            "name": "Kişi Başına Düşen Gelir",
                            "description": "Toplam gelirin nüfusa bölünmesiyle elde edilen göstergedir. Yaşam standardını yansıtır.",
                            "children": [
                                {
                                    "name": "Nominal Kişi Başına Gelir",
                                    "description": "Güncel fiyatlarla hesaplanan kişi başına düşen gelir."
                                },
                                {
                                    "name": "Reel Kişi Başına Gelir",
                                    "description": "Enflasyon düzeltmesi yapılarak hesaplanan kişi başına düşen gelir."
                                },
                                {
                                    "name": "Gelir Dağılımı",
                                    "description": "Kişi başına gelirin dağılımının eşitsizlik seviyeleri."
                                }
                            ]
                        },
                        {
                            "name": "İstihdam Oranı",
                            "description": "Çalışan nüfusun toplam nüfusa oranını ifade eder.",
                            "children": [
                                {
                                    "name": "İşgücü Katılım Oranı",
                                    "description": "Toplam nüfusa oranla işgücüne katılan bireylerin oranı."
                                },
                                {
                                    "name": "Aktif Nüfus Oranı",
                                    "description": "Çalışma yaşı nüfusa oranla aktif (çalışan ve iş arayan) bireylerin oranı."
                                }
                            ]
                        },
                        {
                            "name": "Yatırım Oranı",
                            "description": "Toplam yatırımların GSYH'ya oranını gösterir.",
                            "children": [
                                {
                                    "name": "Sabit Sermaye Yatırımları",
                                    "description": "Makine, bina gibi uzun vadeli yatırımların GSYH içindeki payı."
                                },
                                {
                                    "name": "Stok Yatırımları",
                                    "description": "Stokların GSYH içindeki payı ve ekonomik büyümeye etkisi."
                                }
                            ]
                        },
                        {
                            "name": "İnovasyon Endeksi",
                            "description": "Ülkenin inovasyon kapasitesini ve teknolojik gelişmişliğini ölçen göstergedir.",
                            "children": [
                                {
                                    "name": "Ar-Ge Harcamaları",
                                    "description": "GSYH'ya oranla araştırma ve geliştirmeye yapılan harcamalar."
                                },
                                {
                                    "name": "Patent Sayıları",
                                    "description": "Ülkede alınan patent sayılarının inovasyon düzeyiyle ilişkisi."
                                },
                                {
                                    "name": "Teknoloji Transferi",
                                    "description": "Bilgi ve teknolojinin sektörel ve uluslararası transferi."
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Ekonomik Dalgalanmalar",
            "description": "Ekonomideki kısa vadeli yükseliş ve düşüş dönemleridir. Bu dalgalanmalar, ekonomik döngü olarak da bilinir ve büyüme, daralma, kriz gibi evreleri içerir.",
            "children": [
                {
                    "name": "Çevrim Aşamaları",
                    "description": "Ekonomik döngünün dört ana aşamasını ifade eder.",
                    "children": [
                        {
                            "name": "Genişleme",
                            "description": "Ekonomik aktivitenin arttığı, üretimin ve istihdamın yükseldiği dönemdir. Yatırımlar ve tüketim artar.",
                            "children": [
                                {
                                    "name": "Artan Üretim",
                                    "description": "Üretim kapasitesinin ve çıktı miktarının artması."
                                },
                                {
                                    "name": "İstihdam Artışı",
                                    "description": "Yeni iş olanaklarının yaratılması ve işsizlik oranının düşmesi."
                                }
                            ]
                        },
                        {
                            "name": "Zirve",
                            "description": "Büyümenin en yüksek noktası, ekonomik aktivitenin doruk yaptığı dönemdir. Enflasyonist baskılar başlayabilir.",
                            "children": [
                                {
                                    "name": "Tam Kapasite",
                                    "description": "Ekonominin tam üretim kapasitesine ulaştığı dönem."
                                },
                                {
                                    "name": "Enflasyon Baskıları",
                                    "description": "Talep ve maliyet artışlarının fiyatlar üzerinde oluşturduğu baskılar."
                                }
                            ]
                        },
                        {
                            "name": "Daralma",
                            "description": "Ekonomik aktivitenin azaldığı, üretimin ve istihdamın düştüğü dönemdir. Tüketim ve yatırımlar geriler.",
                            "children": [
                                {
                                    "name": "Üretim Azalması",
                                    "description": "Üretim kapasitesinin ve çıktı miktarının azalması."
                                },
                                {
                                    "name": "İstihdam Azalması",
                                    "description": "İşlerin azalması ve işsizlik oranının yükselmesi."
                                }
                            ]
                        },
                        {
                            "name": "Dip",
                            "description": "Daralmanın en düşük noktasına ulaştığı, ekonomik faaliyetlerin en düşük seviyede olduğu dönemdir. Yeniden toparlanma süreci başlar.",
                            "children": [
                                {
                                    "name": "Ekonomik Yeniden Toparlanma",
                                    "description": "Ekonomik faaliyetlerin yavaş yavaş artmaya başlaması."
                                },
                                {
                                    "name": "Reform ve Yeniden Yapılanma",
                                    "description": "Ekonominin yeniden büyüme için gerekli düzenlemeleri yapması."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Ekonomik Göstergeler",
                    "description": "Ekonomik dalgalanmaları analiz etmek için kullanılan göstergelerdir.",
                    "children": [
                        {
                            "name": "İşsizlik Oranı",
                            "description": "Ekonomik dalgalanmaların işgücü piyasasına etkisini gösterir.",
                            "children": [
                                {
                                    "name": "Normal İşsizlik",
                                    "description": "Friksiyonel ve yapısal işsizliklerin oluşturduğu doğal işsizlik seviyesi."
                                },
                                {
                                    "name": "Fazla İşsizlik",
                                    "description": "Döngüsel faktörlerden kaynaklanan işsizlik artışı."
                                }
                            ]
                        },
                        {
                            "name": "Enflasyon Oranı",
                            "description": "Fiyat seviyesindeki değişimlerin ekonomik döngü üzerindeki etkisini yansıtır.",
                            "children": [
                                {
                                    "name": "Yüksek Enflasyon",
                                    "description": "Fiyatların hızlı ve sürekli bir şekilde arttığı dönemler."
                                },
                                {
                                    "name": "Deflasyon",
                                    "description": "Fiyatların genel seviyesinin düşüş gösterdiği dönemler."
                                }
                            ]
                        },
                        {
                            "name": "GSYH Büyüme Oranı",
                            "description": "Ekonomik genişleme ve daralma dönemlerinin büyüme üzerindeki etkisini analiz eder.",
                            "children": [
                                {
                                    "name": "Pozitif Büyüme",
                                    "description": "Ekonominin genişleme döneminde olduğu ve GSYH'nın arttığı durum."
                                },
                                {
                                    "name": "Negatif Büyüme",
                                    "description": "Ekonominin daralma döneminde olduğu ve GSYH'nın azaldığı durum."
                                }
                            ]
                        },
                        {
                            "name": "Tüketici Güveni",
                            "description": "Tüketicilerin ekonomik geleceğe yönelik beklentilerini ve harcama eğilimlerini ölçer.",
                            "children": [
                                {
                                    "name": "Güven Düşüşü",
                                    "description": "Tüketicilerin ekonomik duruma dair olumsuz beklentilerinin artması."
                                },
                                {
                                    "name": "Güven Artışı",
                                    "description": "Tüketicilerin ekonomik duruma dair olumlu beklentilerinin artması."
                                }
                            ]
                        },
                        {
                            "name": "Sanayi Üretim Endeksi",
                            "description": "Sanayi sektöründeki üretim hacminin değişimini gösterir.",
                            "children": [
                                {
                                    "name": "Üretim Artışı",
                                    "description": "Sanayi üretiminin arttığı dönemler."
                                },
                                {
                                    "name": "Üretim Azalışı",
                                    "description": "Sanayi üretiminin azaldığı dönemler."
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Politika Tepkileri",
                    "description": "Ekonomik dalgalanmalara karşı hükümet ve merkez bankalarının uyguladığı politikalar.",
                    "children": [
                        {
                            "name": "Maliye Politikası",
                            "description": "Ekonomik daralma dönemlerinde kamu harcamalarını artırma ve vergileri düşürme, genişleme dönemlerinde ise kamu harcamalarını azaltma ve vergileri artırma stratejileridir.",
                            "children": [
                                {
                                    "name": "Faiz Oranı Politikası",
                                    "description": "Maliye politikasının faiz oranları üzerindeki etkisi."
                                },
                                {
                                    "name": "Vergi Düzenlemeleri",
                                    "description": "Vergi oranlarının ayarlanması ve vergi politikalarının ekonomik duruma göre değiştirilmesi."
                                }
                            ]
                        },
                        {
                            "name": "Para Politikası",
                            "description": "Faiz oranlarını düşürerek ekonomik aktiviteyi teşvik etme veya faiz oranlarını yükselterek enflasyonu kontrol altına alma stratejileridir.",
                            "children": [
                                {
                                    "name": "Faiz İndirimi",
                                    "description": "Ekonomik büyümeyi teşvik etmek amacıyla merkez bankasının faiz oranlarını düşürmesi."
                                },
                                {
                                    "name": "Faiz Artırımı",
                                    "description": "Enflasyonu kontrol altına almak için merkez bankasının faiz oranlarını yükseltmesi."
                                }
                            ]
                        },
                        {
                            "name": "Likidite Sağlama",
                            "description": "Finansal kriz dönemlerinde bankalara likidite sağlayarak finansal sistemin istikrarını koruma çabalarıdır.",
                            "children": [
                                {
                                    "name": "Acil Likidite Desteği",
                                    "description": "Bankalara kısa vadeli borç verme ve likidite sağlama."
                                },
                                {
                                    "name": "Likidite Rezervleri",
                                    "description": "Bankaların merkez bankasında tutulan ek likidite rezervleri."
                                }
                            ]
                        },
                        {
                            "name": "Yapısal Reformlar",
                            "description": "Ekonominin uzun vadeli istikrarını sağlamak için iş gücü piyasası, vergi sistemi ve düzenleyici çerçevelerde yapılan değişikliklerdir.",
                            "children": [
                                {
                                    "name": "İşgücü Piyasası Reformları",
                                    "description": "İşgücü piyasasının esnekliğini artırmak ve istihdamı kolaylaştırmak için yapılan düzenlemeler."
                                },
                                {
                                    "name": "Vergi Sistemi Reformları",
                                    "description": "Vergi yapısının yeniden düzenlenmesi ve vergi adaletinin sağlanması."
                                },
                                {
                                    "name": "Regülasyon Reformları",
                                    "description": "Piyasa düzenlemelerinin iyileştirilmesi ve ekonomik etkinliğin artırılması."
                                }
                            ]
                        },
                        {
                            "name": "Kriz Yönetimi",
                            "description": "Ekonomik krizlerin etkilerini azaltmak için acil müdahaleler ve destek programları geliştirilmesidir.",
                            "children": [
                                {
                                    "name": "Acil Durum Fonları",
                                    "description": "Kriz dönemlerinde kullanılmak üzere ayrılan finansal kaynaklar."
                                },
                                {
                                    "name": "Destek Programları",
                                    "description": "İşsizlere, işletmelere ve hanehalklarına yönelik acil destek paketleri."
                                },
                                {
                                    "name": "Mali İstikrar Önlemleri",
                                    "description": "Ekonomik istikrarı sağlamak için uygulanan mali önlemler ve politikalar."
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}
